from database import Database
import os

if os.path.exists("space.db"):
    os.remove("space.db")
    print("🗑 Стару базу видалено.")

db = Database('space.db')

# (Назва, Опис, Складність, Нагорода, Планета, is_Boss, COST, RES_NAME, RES_AMT)
missions_data = [
    # --- EARTH ---
    ("Тестовий пуск", "Перевірка систем", 1, 300, "Earth", False, 50, None, 0),
    ("GPS Супутник", "Комерційний вантаж", 2, 600, "Earth", False, 100, "res_iron", 50),
    ("Орбітальний ремонт", "Вихід у відкритий космос", 3, 900, "Earth", False, 200, "res_fuel", 100),
    ("Політ на Місяць", "Трансферна орбіта (BOSS)", 5, 2000, "Earth", True, 1000, "res_fuel", 300),

    # --- MOON ---
    ("Дослідження кратера", "Пошук місця для бази", 4, 1200, "Moon", False, 400, "res_iron", 200),
    ("Буріння льоду", "Отримання води", 5, 1500, "Moon", False, 500, "res_regolith", 150),
    ("Курс на Марс", "Гравітаційний маневр (BOSS)", 8, 4000, "Moon", True, 2500, "res_he3", 500),

    # --- 3. MARS (Марс) ---
    ("Марсохід Curiosity", "Розвідка місця посадки", 7, 2500, "Mars", False),
    ("Колонія 'Ares'", "Перше поселення людей", 8, 3500, "Mars", False),
    ("Тераформування", "Запуск атмосферних генераторів", 9, 4500, "Mars", False),
    ("Гравітаційний маневр", "Розгін до Юпітера (BOSS)", 10, 6000, "Mars", True),  # -> Jupiter

    # --- 4. JUPITER (Юпітер) ---
    ("Супутники Галілея", "Дослідження Європи та Іо", 11, 7000, "Jupiter", False),
    ("Атмосферний зонд", "Занурення у велику червону пляму", 12, 9000, "Jupiter", False),
    ("Повернення Героїв", "Шлях додому (FINAL)", 15, 15000, "Jupiter", True),  # -> End/Earth
]

for m in missions_data:
    db.add_mission(m[0], m[1], m[2], m[3], m[4], m[5], m[6], m[7], m[8])

print("✅ Місії завантажено з цінами та ресурсами.")
