from database import Database

db = Database('space.db')

missions = [
    ("Суборбітальний політ", "Тест систем. Підйом на 100 км.", 1, 100),
    ("Орбітальний політ", "Перший виток навколо Землі.", 2, 250),
    ("Вивід супутника", "Доставка корисного вантажу.", 2, 400),
    ("Політ на Місяць", "Обліт супутника без посадки.", 3, 800),
    ("Посадка на Місяць", "Історичний момент.", 4, 1500),
]

for m in missions:
    db.add_mission(m[0], m[1], m[2], m[3])

print("✅ Місії завантажено в БД!")